//
// Need for Speed: The Run - Helper script for custom LAN online gameplay
// by Hypercycle / And799 / mRally2
//

#define WIN32_LEAN_AND_MEAN
#include "LANOnlineHelper.h"

#include <thread>
#include <random>

#include "includes/injector/injector.hpp"
#include "includes/injector/assembly.hpp"
#include "includes/mini/ini.h"
#include "includes/patterns.hpp"

//
// Variables
//

bool IsClient = false;
bool IsServer = false;
bool TestConsole = false;

char wndTitle[100];
char wndTitleCopy[100];
char* gameCurrentLevelStr;

int PlaylistSetArrayID = 0;
int PlaylistID = 0;
uint32_t forcedGarageCarHash;
char langCode[] = "en_Us";

std::mt19937 rng;
mINI::INIStructure ini;

//
// Util
//

__declspec(naked) uint32_t EndianSwap(uint32_t value)
{
	__asm
	{
		mov eax, dword ptr[esp + 4]
		bswap eax
		ret
	}
}

void RemoveSpaces(std::string str)
{
	str.erase(remove(str.begin(), str.end(), ' '), str.end());
}

void StartTestConsole()
{
	AllocConsole();
	FILE* fDummy;
	freopen_s(&fDummy, "CONIN$", "r", stdin);
	freopen_s(&fDummy, "CONOUT$", "w", stderr);
	freopen_s(&fDummy, "CONOUT$", "w", stdout);
}

template<typename... Args>
// Always use c_str() for any non-char string here
void TestConsolePrint(const char* format, Args&&... args) {
	if (TestConsole) {
		std::printf(format, std::forward<Args>(args)...);
	}
}

std::string PtrToHexStr(uintptr_t ptr)
{
	std::stringstream stream;
	stream << std::hex << ptr;
	std::string hexStr = "0x" + stream.str();
	return hexStr;
}

// Check for int hex > string hex conversion
std::string SWIntToHexStr(uint32_t value)
{
	value = EndianSwap(value);
	std::stringstream stream;
	stream << std::hex << value;
	std::string hexStr = stream.str();
	return hexStr;
}

// Check for numeric string > hex conversion
unsigned long StrToULong(std::string str)
{
	return strtoul(str.c_str(), 0, 10);
}

// Check for string hash conversion
unsigned long StrHashToULong(std::string str)
{
	unsigned long value = strtoul(str.c_str(), 0, 16);
	value = EndianSwap(value);
	return value;
}

void CheckForMaxMinFloat(float value, float min, float max)
{
	if (value > max) {
		value = max;
	}
	if (value < min) {
		value = min;
	}
}

void CheckForMaxMinInt(int value, int min, int max)
{
	if (value > max) {
		value = max;
	}
	if (value < min) {
		value = min;
	}
}

std::vector<std::string> SplitStr(const std::string& str, char delimiter) {
	std::vector<std::string> tokens;
	std::string token;
	std::istringstream tokenStream(str);
	while (getline(tokenStream, token, delimiter)) {
		tokens.push_back(token);
	}
	return tokens;
}

inline std::string ConcatStrVec(std::vector<std::string> vec, char delimiter) {
	std::string out = vec[0];
	for (unsigned int i = 1; i < vec.size(); i++) {
		out += delimiter + vec[i];
	}
	return out;
}

void InitRandomGen()
{
	std::mt19937 rngTmp(
		(unsigned int)std::chrono::steady_clock::now().time_since_epoch().count());
	rng = rngTmp;
}

//
// Structures
//

// GUID takes 0x10 bytes, pointers refers on class after it.
// Usually Array Pointers contains sizes at -0x4 position.
namespace ebx
{ 
	namespace playlists
	{
		class PlaylistSet {
		public:
			uintptr_t pt_EBXTypeHeader;		// 0x00
			uintptr_t pt_UnkRef;			// 0x04
			char EBXUnkCommonPart[4];		// 0x08
			uintptr_t pt_EBXNamePtr;		// 0x0C
			uintptr_t pt_DefaultPlaylist;	// 0x10
			uintptr_t ar_PlaylistGroups;	// 0x14
			char _Padding[12];				// 0x18
		};
		class PlaylistGroup {
		public:
			int count;
			std::vector<uintptr_t> pt_Playlists;
		};
		class PlaylistGroupArray {
		public:
			int count;
			std::vector<uintptr_t> pt_PlaylistGroup;
			std::vector<PlaylistGroup> PlaylistGroups;
		};
	}
	
};

uintptr_t clientOnlineEntityPtr = 0x2888F7C;
uintptr_t clientCareerEntityPtr = 0x28823BC;
uintptr_t serverCareerEntityPtr = 0x27A3300;
namespace mem
{
	namespace Client
	{
		class OnlineEntity {
		public:
			char EntityHeaderPart[8];		// 0x00
			BYTE IsSinglePlayer;			// 0x08
			BYTE IsLocalHost;				// 0x09
			BYTE IsInprocClient;			// 0x0A
			BYTE _UnkByte;					// 0x0A
			char _VarData1[64];				// 0x0C
			uint32_t SocketMode;			// 0x4C
			char _VarData2[84];				// 0x50
			uint32_t ConnectionState;		// 0xA4
		};

		class CareerEntity {
		public:
			char EntityHeaderPart[4];		// 0x00
			uint32_t PlaylistSessionId;		// 0x04
			uint32_t PlaylistRouteId;		// 0x08
			uintptr_t PlaylistSet;			// 0x0C
			uintptr_t CurrentPlaylist;		// 0x10
			char _VarData1[452];			// 0x14
			uint32_t CareerState;			// 0x1D8
			char _VarData2[12];				// 0x1DC
			uint32_t PListObjectivesValue;	// 0x1E8
		};

		class RoutePlayerEntity {
		public:
			char _VarData1[16];				// 0x00
			uint32_t PlayerID;				// 0x10
			uint32_t IsAI;					// 0x14
			uint32_t State1;				// 0x18
			uint32_t State2;				// 0x1C
			uint32_t RacePlace;				// 0x20
			float RoutePercentPassed;		// 0x24
			float RouteMetersPassed;		// 0x28
		};
	}
	namespace Server
	{
		class CareerEntity {
		public:
			char EntityHeaderPart[4];			// 0x00
			uint32_t PlaylistSessionId;			// 0x04
			uint32_t PlaylistRouteId;			// 0x08
			uintptr_t PlaylistSet;				// 0x0C
			uintptr_t CurrentPlaylist;			// 0x10
			char _VarData1[32];					// 0x14
			uint32_t PlayerCount;				// 0x34
			char _VarData2[4152];				// 0x38
			uint32_t CareerState;				// 0x1070
			float CareerStateTimer;				// 0x1074
			char _VarData3[8];					// 0x1078
			uint32_t PlaylistSessionsCount;		// 0x1080
			// And more unknown data
		};
	}
}

mem::Server::CareerEntity* serverCareerEnt;

mem::Client::OnlineEntity* onlineEnt;
// This pointer could be null sometimes, during connection attempts
// Also this pointer always being present during single-player
bool IsOnlineEntityExists()
{
	bool idk = *(int*)clientOnlineEntityPtr != 0;
	if (idk)
	{
		onlineEnt = *(mem::Client::OnlineEntity**)clientOnlineEntityPtr;
	}
	return idk;
}

mem::Client::CareerEntity* clientCareerEnt;
void UpdateClientCareerEntityPtr()
{
	clientCareerEnt = *(mem::Client::CareerEntity**)clientCareerEntityPtr;
}

uintptr_t gameCurrentLevelPtr = 0x289BDC8;

//
// Playlists
//

int GetPlaylistArrayConfigValue()
{
	std::string playlistSetArrayIDStr = ini.get(PlaylistCfg).get("ForcePlaylistSetArrayID");
	int playlistSetArrayID = StrToULong(playlistSetArrayIDStr);
	if (playlistSetArrayID < 0) { playlistSetArrayID = 0; }
